using System;

namespace MultiplyBy2
{
    class Program
    {
        static void Main(string[] args)
        {
            // Напишете програма, която да умножава положителни числа по 2.
            //От конзолата се четат поредица от реални числа, всяко на нов ред, докато не се въведе отрицателно.
            //След всяко умножено число на нов ред да се отпечата "Result: {резултата от умножението}".
            //Резултата от умножението да бъде форматиран до втория знак след десетичния разделител.
            // При получаване на негативно число, на конзолата да се отпечата "Negative number!"
            //и програмата да приключи изпълнение.
            int n = int.Parse(Console.ReadLine());
            for (int i = 0; i < n; i++)
            {
                if (i % 2 == 0)
                {

                }
            }
        }
    }
}
